/**
 * Created by Administrator on 2017/3/30 0030.
 */
var data = [];
var dataStr = '1、陈奕迅<br>\
<br>\
 陈奕迅是华语流行音乐的代表人物之一，被誉为华语流行音乐张学友的接班人。曾被美国《时代》杂志形容为影响香港乐坛风格的人物。2005年推出的专辑《U87》被《时代》杂志评为2005年亚洲五张最值得购买的专辑。陈奕迅是一个实力派的歌手，他的许多歌被人熟悉，比如说《十年》、《爱情转移》，而且在他部分歌曲是具有深意，像《浮夸》和《最佳损友》<br>\
<br>\
<br>\
2、邓紫棋<br>\
<br>\
邓紫棋有“小巨肺”之称，不仅唱得好，在乐器方面也有很好的天分，演唱会上她弹吉他、打鼓像一个女摇滚战士，她一袭白裙安静地弹钢琴，顿时又变成女神，她在粤语歌坛拥有大批粉丝并享有一定的知名度。在《我是歌手》的舞台上，她又以强大的实力和青春活力的形象获得大批大陆和海外粉丝。代表作《泡沫》等<br>\
<br>\
<br>\
3、李荣浩<br>\
<br>\
 李荣浩，对流行脉搏有良好的触摸，他明白“悦耳”是怎么一回事。李荣浩是一个对音乐有着理想化追求的全方位创作人，他痴迷于Soul、R&B等黑人音乐，那些让人心窝儿倍舒坦的节奏和音色，直接师承美国骚灵时代，但却又把华语听众群习惯照顾得如此妥帖。这就是李荣浩的才能，也是Made In China的才能。代表作《模特》等<br>\
<br>\
<br>\
4、李宇春<br>\
<br>\
 李宇春是一个真正由中国民众自发投票选出的大众明星，是中国新娱乐时代的标志。她是中国的孤本偶像，是中国十年文化艺术中最具影响力的人物。她成就了乐坛奇迹的同时也证明了中国偶像的世界影响力，在成名之后，迅速登上美国《时代周刊》亚洲版封面，美国TODAY和英国BBC等国际媒体也纷纷专题报道，使其蜚声国际。代表作《皇后与梦想》等<br>\
<br>\
<br>\
5、林俊杰<br>\
<br>\
  JJ拥有自己的音乐制作公司、潮牌，这些都是他不断努力提升自己的成果。音乐事业上，舞台、钢琴、情歌和林俊杰的心，就是他的“Relevance”。其实在现实生活里，无论是在感情上或是经商，他也体会到了自己太容易接受的心态，并有感而发地问：“人如果把自己的面具拿下来，还能看吗？”。代表作《江南》等<br>\
<br>\
<br>\
6、莫文蔚<br>\
<br>\
 莫文蔚长得漂亮，有特立独行的作派，所以女人才会觉得她很现代，而有些男人会觉得她很性感。她亦不介意在电影中作出丑态百出的装扮或行为；她是个有魅力的女人，她不够漂亮，却能被称为“亚洲第一美女”，她的脸上写满了风情和超强的自信。莫文蔚积极投身于公益事业之中，凭借着自己的影响力，引导大家为公益慈善做奉献。代表作《忽然之间》等<br>\
<br>\
<br>\
7、那英<br>\
<br>\
那英，中国歌坛超级巨星，在华语乐坛极具影响力，被誉为中国内地第一天后，”亚洲天后“，驰骋华语乐坛二十多年，在华语乐坛拥有不可替代的号召力，被《Time》时代杂志评为“13亿华人最爱的声音”，更有东方惠特妮·休斯顿的美誉。那英的歌声让我们得到了久违的感动，她用歌声唱出了对爱的执着，对爱的勇敢，对爱的奋不顾身，那英永远相信爱情是最动人的。代表作《征服》等<br>\
<br>\
<br>\
8、谭维维<br>\
<br>\
 谭维维嗓音优美，音域较宽，一般可在两个八度以内自如地的演唱，并可演绎多种风格的歌曲。她在四川音乐学院声乐系学习期间受过严格的训练，毕业后又接触了大量的流行音乐，对流行音乐有较深的认识，对于新作品的理解和演绎也基本一步到位。她是一位有一定潜质、可塑性很强的歌手。代表作《谭某某》等<br>\
<br>\
<br>\
9、陶喆<br>\
<br>\
  对于 21 世纪初那段台湾流行音乐最后的黄金岁月，相信不管是 70 后 80 后 90 后乃至部分的 00 后都是对此耳熟能详，而在大放异彩的音乐风格华语 R&B 的代表中，陶喆更是被许多知名人士冠以 “华语 R&B 教父” 的称号，陶喆是个作歌非常细腻的人，他用他的R&B，用他的节拍，从歌里反映到了现在的东西。那是我们一直在讲的歌的本质，反映生活上的现象。代表作《黑色柳丁》等<br>\
<br>\
<br>\
10、汪峰<br>\
<br>\
 汪峰音乐作品透着浓郁的人文气质和文化内涵，最富画面感，最忧伤而且动听，音乐旋律优美，配器讲究，不失摇滚乐一贯特质，直指人心灵的最深处。他是一个名副其实的歌手诗人，他的音乐有抗争而不颓废，有呐喊而不尖叫，有挣扎而不自虐。在迷茫的人生意义路上，像一个孤儿，像一只麋鹿，却依然能够伴随着你走出困窘的天地。代表作品有《春天里》、《怒放的生命》等。<br>\
<br>\
<br>\
11、王菲<br>\
<br>\
 王菲的嗓子是她最大的财富，极富质感，空灵如天籁，辨识度极高。王菲可以敏锐地捕捉到流行文化的时尚元素，因此中国香港地区以及欧美、日本流行文化对她的影响完全可以体现在她的身上。她把比约克的形象设计搬过来，把“小红莓”乐队的“咽音”模仿过来，在唱片封面设计上越来越大胆，用时尚手段弥补了她与香港艺人之间的落差。代表作《红豆》、《天空》等<br>\
<br>\
<br>\
12、王力宏<br>\
<br>\
 他既是王子又是浪人，他的外表帅气，音乐才华也没的说，对音乐创作十分专注，他的音乐都是有灵魂的。完美得近乎虚幻，如天使一般纯明的笑容，如天籁一般完美的音乐，如王子一般高雅的气质。代表作《唯一》等<br>\
<br>\
<br>\
13、吴莫愁<br>\
<br>\
 吴莫愁，新生代个性女歌手、新女性主义代言人。莫愁有着饱满的情绪、扎实的唱功、新颖的唱法和十足欧美范儿的摇滚，被誉为中国版的“lady gaga”。2012年网易女人发起“2012年度女性榜样”网络票选，吴莫愁因其鲜明的个人风格，不拘一格的自我凸显，成为独一无二的新生代歌手优秀代表。代表作《就现在》等<br>\
<br>\
<br>\
14、信<br>\
<br>\
 苏见信的声音是令人惊艳的，带有着极深、极广的穿透力，他有着动真情的深沉与发自真心的内省，没有狂妄叫嚣、也没有愤慨群埃而信的唱腔中，真假音自然漂亮地转换，轻易地将情绪藉由声音扩散开来，一股强烈的情绪感染魔力，直入人心，让所有听过信声音的人都会对其有深刻的印象 。代表作《死了都要爱》等<br>\
<br>\
<br>\
15、许嵩<br>\
<br>\
 许嵩，内地独立音乐人，是集作词、作曲、制作、编曲、混音、唱片企划于一身的全能型音乐人。2009-2012年，四年推出四张词曲全创作专辑。以这四张备受好评的作品，许嵩在内地乐坛扎实占领一席之地。很多的人在听歌；很多的歌被人听；很多的歌一听就知道是谁唱的；但很少的歌一听或一读就知道是谁写的——只有许嵩，他的个人的气息永远浓郁，让人一眼便可辨识。代表作《素颜》等<br>\
<br>\
<br>\
16、薛之谦<br>\
<br>\
 从《认真的雪》《深深爱过你》再到《几个你》《我知道你都知道》和 《方圆几里》深情款款的“薛氏情歌”是他的不变招牌。男人有的时候是个“多面体”，拥有很多不同的层面。大男孩的顽皮、成熟男人的优雅绅士，光影中的薛之谦亦是如此。“我不会写煽情的文字，但是我会用音乐表达情感，我会用我的努力回报所有支持我的人。”歌手、演员、主持人，拥有多重身份的他，就像他的文字一样，简单而又纯粹。代表作《丑八怪》等<br>\
<br>\
<br>\
17、杨坤<br>\
<br>\
 杨坤的声音与众不同，磁性十足，从事音乐将近8年的时间，在音乐创作的道路上一直在不断的探索，并树立了属于自己的创作风格。他的音乐绝大部分都在传达着伤感的情绪，很容易让人无法自拔，情愿去享受伤感情绪所营造出的如咖啡般苦涩却回味无穷的氛围而不愿脱身。代表作《无所谓》等<br>\
<br>\
<br>\
18、周杰伦<br>\
<br>\
 毫无疑问，过去十年来，没有谁像周杰伦那样给华语主流乐坛带来过那么多的影响和争议。从所谓东西合璧的“中国风”到囫囵吞枣式的说唱，从咬字不清到辣妹子辣，这其中当然包括方文山的歌词，一切的一切，最后成就了传统唱片业时代最后的辉煌。他的作品实在太多太多，而且曲风也随意切换，pop、R&B、中国风、慢摇、电子摇滚等，他是一个音乐天才，他的乐器功夫了得，钢琴吉他炉火纯青。代表作《稻香》、《双节棍》等<br>\
<br>\
<br>\
';

//下面的代码是将dataStr中的内容拆分存放到data数组中
var d = dataStr.split('<br><br><br>');
for(var i = 0;i < d.length-1; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img:c[0].replace('、','')+'.jpg',
        caption:c[0].split('、')[1],
        desc:c[1]
    });
}